package com.lidesheng.hyperlyric.utils

data class ChangelogItem(
    val version: String,
    val title: String,
    val summary: String
)

object ChangelogData {
    fun getChangelog(): List<ChangelogItem> {
        return listOf(
            ChangelogItem(
                version = "7.3-1937",
                title = "修复已知问题",
                summary = "- 新增插件功能,并将 AI 翻译功能移至插件\n" + 
                        "- 新增分离歌词下一句预览功能\n" +
                        "- 新增解除手机端超级岛最大长度限制功能\n" +
                        "- 移除遗留代码，优化混淆保护规则，优化安装包体积"
            ),
            ChangelogItem(
                version = "7.2-1937",
                title = "修复了一些错误",
                summary = "- 新增超级岛动态长度判断基准选项\n" +  
                        "- 优化歌词源页面内容显示\n" +
                        "- 修复 Lyricinfo 歌词源判断出错的问题\n" +
                        "- 歌词模式改为分离歌词开关并移至超级岛设置页"
            ),
            ChangelogItem(
                version = "7.1-1937",
                title = "修复了一些错误，优化了一些体验",
                summary = "- 新增逐字歌词模拟成逐行歌词显示\n" +  
                        "- 新增小米超级岛主动刷新机制，优化设置生效体验\n" +
                        "- 新增 SuperLyric 应用列表页面\n" +
                        "- 新增阿拉伯语与 RTL 布局支持\n" +
                        "- 新增歌词源独立页面，整合歌词源与歌词提供者页面\n" +
                        "- 统一超级岛媒体卡片进度条尾部光辉的控制\n" +
                        "- 优化 Xposed 模块描述信息和应用相关文档说明\n" +
                        "- 优化歌词源媒体信息获取\n" +
                        "- 优化歌词源媒体会话与取色状态\n" +
                        "- 优化 LyricInfo 歌词源下自动切歌状态处理\n" +
                        "- 优化页面组件间距\n" +
                        "- 优化 SuperLyric 歌词源时歌词显示的问题，按歌词会话恢复超级岛注入状态\n" +
                        "- 修复 RTL 布局下多媒体卡片横向切换时的错误\n" +
                        "- 修复音乐信息使用媒体元数据带来的错误\n" +
                        "- 修复切歌后音乐信息刷新竞态问题\n" +
                        "- miuix 提升到 0.9.4-rc01"
            ),
            ChangelogItem(
                version = "7.0-1936",
                title = "新增了一些还不错的功能",
                summary = "- 新增 MIUI 同款多媒体卡片切换功能\n" +
                        "- 新增超级岛歌词动态长度功能，支持普通歌词视图和分离歌词视图\n" +
                        "- 新增歌词右对齐显示\n" +
                        "- 新增内容布局，分离音乐信息和歌词视图的布局显示\n" +
                        "- 新增自定义音乐信息布局，增加更多选项\n" +
                        "- 新增英数窄字体样式\n" +
                        "- 新增媒体卡片柔光封面背景样式跟随系统深浅色\n" +
                        "- 新增支持无歌词时恢复默认超级岛布局\n" +
                        "- 隔离音乐信息和歌词的刷新机制\n" +
                        "- 优化首页布局\n" +
                        "- 优化关于页面大图标折叠滚动显示效果\n" +
                        "- 优化了好多个页面的布局显示\n" +
                        "- 优化超级岛长度的设置\n" +
                        "- 优化逐字歌词显示效果\n" +
                        "- 优化歌词渐变色显示效果\n" +
                        "- 优化日志输出\n" +
                        "- 修复全屏 AOD 下波浪进度条显示异常的问题\n" +
                        "- 修复了媒体卡片很多个相关问题\n" +
                        "- 修复了不少我想不起来的问题"
            ),
            ChangelogItem(
                version = "6.8-1936",
                title = "",
                summary = "- 新增媒体卡片进度条样式和尾部光辉功能\n" +
                        "- 新增媒体卡片布局样式选择\n" +
                        "- 新增禁止息屏显示媒体卡片折叠功能\n" +
                        "- 新增逐字歌词拉丁字母按字母逐个上浮\n" +
                        "- 优化超级岛长度设置\n" +
                        "- 优化超级岛内容布局与样式选择\n" +
                        "- 优化文字颜色选项布局\n" +
                        "- 优化边缘光效进度条封面渐变色显示效果\n" +
                        "- 优化倒计时圆点显示效果\n" +
                        "- 优化 AI 翻译语言跳过功能\n" +
                        "- 将小米系统界面组件从作用域中移除\n" +
                        "- 调整逐字歌词拉丁字母上浮动画默认参数\n" +
                        "- 修复 lyricinfo 歌词源下多 MediaSession 时触发的歌词取消注入的问题\n" +
                        "- 修复歌词文字颜色变化时引起的动画触发的问题\n" +
                        "- 修复媒体卡片相关错误"
            ),
            ChangelogItem(
                version = "6.7-1935",
                title = "其实地上本没有路，走的人多了，也便成了路。",
                summary = "- 新增媒体卡片元素和布局控制的功能\n" +
                        "- 新增占位符格式自定义功能和倒计时圆点\n" +
                        "- 新增超级岛歌词颜色跟随状态栏反色功能\n" +
                        "- 优化文字样式页面布局\n" +
                        "- 优化媒体卡片页面布局\n" +
                        "- 优化歌词提供者页面的显示\n" +
                        "- 优化项目引用页面布局\n" +
                        "- 将 AI 翻译功能抽离到 online 版本\n" +
                        "- 翻译页面改名为双行内容\n" +
                        "- 修复超级岛首次创建时歌词不显示的问题\n" +
                        "- 修复取色缓存和取色异常问题\n" +
                        "- 修复焦点通知状态栏图标参数漏传的错误"
            ),
            ChangelogItem(
                version = "6.6-1935",
                title = "故乡的山水也都渐渐远离了我，但我却并不感到怎样的留恋，我只觉得我四面有看不见的高墙，将我隔成孤身",
                summary = "- 新增 lyricon 歌词提供器歌词偏移功能\n" +
                        "- 新增歌词源使用提示\n" +
                        "- 新增隐藏桌面图标功能\n" +
                        "- 新增模糊效果开关\n" +
                        "- 修复歌词刷新后的宽度状态同步问题\n" +
                        "- 修复封面取色以及相关问题\n" +
                        "- 修复重装后配置残留的问题\n" +
                        "- 更改部分默认值\n" +
                        "- 修复对于部分音乐软件无法获取专辑名称的问题\n" +
                        "- 修复在线歌词搜索异常的问题\n" +
                        "- 优化超级岛暂停后恢复默认的效果\n" +
                        "- 优化混淆保护范围，缩减安装包体积\n" +
                        "- 优化主页、关于页与贡献者页面布局"
            ),
            ChangelogItem(
                version = "6.5-1934",
                title = "",
                summary = "- 新增显示下一句歌词“自动切换翻译”功能\n" +
                        "- 新增通知型歌词焦点通知启用开关，支持单独保留超级岛\n" +
                        "- 修复超级岛展开态媒体卡片下拉的过渡动画\n" +
                        "- 修复刚创建歌词视图触发动画导致NPE的问题\n" +
                        "- 修复封面色提取失效的问题\n" +
                        "- 修复暂停后超级岛不缩回及播放时不撑开的问题\n" +
                        "- 优化了一些日志内容"
            ),
            ChangelogItem(
                version = "6.4-1934",
                title = "燃尽了",
                summary = "- 新增媒体卡片“音频封面样式”、“隐藏来源标识”、“隐藏设备切换按钮”功能\n" +
                        "- 新增媒体卡片动态流光“封面流光”样式\n" +
                        "- 新增媒体卡片背景“柔光封面”样式\n" +
                        "- 新增 AI 翻译强制覆盖已有译文功能\n" +
                        "- 新增“边缘光效进度条”上下双向样式\n" +
                        "- 优化超级岛展开态媒体卡片浅色背景下的显示效果\n" +
                        "- 优化媒体卡片动态流光表现\n" +
                        "- 移除歌词翻译显示控制值，由hyperlyric统一管理\n" +
                        "- 修复通知中心媒体卡片收起动画异常\n" +
                        "- 修复了一些错误\n" +
                        "- 优化了一些性能\n" +
                        "- 优化了页面布局以及关于页面\n" +
                        "- 优化热重载内容\n" +
                        "- 规范日志内容输出"
            ),
            ChangelogItem(
                version = "6.3-1934",
                title = "应该算是大更新吧",
                summary = "- 新增“边缘光效进度条”功能\n" +
                        "- 新增“音频律动封面色”功能\n" +
                        "- 新增“音频封面样式”自定义功能\n" +
                        "- 新增“媒体卡片”背景颜色和动态流光自定义功能\n" +
                        "- 修复了一些错误\n" +
                        "- 优化页面布局"
            ),
            ChangelogItem(
                version = "6.2-1933",
                title = "晚上好",
                summary = "- miuix 更新至0.9.3\n" +
                        "- libxposed api 更新至102，适配热重载\n" +
                        "- 优化小米超级岛歌词自定义配置的界面布局"
            ),
            ChangelogItem(
                version = "6.1-1933",
                title = "修 bug 为主~",
                summary = "- 新增应用语言切换功能\n" +
                        "- 新增下一句歌词显示功能，仅支持 lyricon 和 lyricinfo 歌词源\n" +
                        "- 修复超级岛歌词和光效注入延迟的错误\n" +
                        "- 移除严苛的翻译显示判断条件\n" +
                        "- 优化应用收进超级岛的过渡动画\n" +
                        "- 移除超级岛设置页的长度控制滑条\n" +
                        "- 修复上个版本不小心删除的更新日志\n" +
                        "- 修复了一些 bug，优化了一些功能"
            ),
            ChangelogItem(
                version = "6.0-1932",
                title = "本次更新只针对无root模式",
                summary = "- 重构 service 服务\n" +
                        "- 新增 metadata 歌词源选择\n" +
                        "- 移除在线歌词缓存上限\n" +
                        "- 更改歌曲信息的数据来源\n" +
                        "- 修复一些遗漏的错误"
            ),
            ChangelogItem(
                version = "6.0-1931",
                title = "comming soon",
                summary = "- 新增应用图标\n" +
                        "- 新增 SuperLyric 和 LyricInfo 歌词源，支持实时切换。SuperLyric 不支持 ai 翻译功能\n" +
                        "- 新增“分离歌词”歌词模式，支持实时切换\n" +
                        "- 新增应用日志，优化、调整、新增更多日志内容和日志显示\n" +
                        "- 新增ai翻译“自动跳过已有翻译歌曲”\n" +
                        "- 新增版本更新提示弹窗\n" +
                        "- 大幅重构项目\n" +
                        "- 优化小米超级岛歌曲信息组合内容和数据获取\n" +
                        "- 优化引导页面和使用帮助页面\n" +
                        "- 移除 Lyricon central\n" +
                        "- 移除hook模式白名单绑定和判断，暂停注入控制移至主页“小米超级岛歌词”开关，优化使用体验\n" +
                        "- 修复AI翻译自动跳过中文歌曲不生效的错误\n" +
                        "- 修复边缘光效颜色不独立生效的问题\n" +
                        "- 修复个别在线歌词会误删空格的错误\n" +
                        "- 修复 LyricParsers 会误删空格的错误\n" +
                        "- 修复不少想不起来的错误\n" +
                        "- 更改在线歌词缓存至外部存储"
            ),
            ChangelogItem(
                version = "5.10-1929",
                title = "食盐了，上个版本的shizuku操作不当会引起软件崩溃，得连夜赶工o_o ....",
                summary = "- 修复shizuku异常关闭引起的错误\n" +
                        "- 超级岛内容长度下限改至20\n" +
                        "- 移除“羽化边缘长度”的滑块"
            ),
            ChangelogItem(
                version = "5.9-1929",
                title = "以后更新节奏放缓",
                summary = "- 新增shizuku绕过焦点通知限制\n" +
                        "- 优化日志页面和日志内容\n" +
                        "- 优化bottomsheet页面样式\n" +
                        "- 修复焦点通知aod显示内容错误\n" +
                        "- 修复ai翻译引发的错误"
            ),
            ChangelogItem(
                version = "5.9-1928",
                title = "仅针对xposed功能的修复",
                summary = "- 修复取色延迟的错误"
            ),
            ChangelogItem(
                version = "5.8-1928",
                title = "小更新",
                summary = "- 超级岛内容新增metadata标题和艺术家双行信息显示\n" +
                        "- 新增焦点通知歌词“歌曲信息强调色”\n" +
                        "- 新增焦点通知超级岛“歌词强调色”\n" +
                        "- 优化“通知型灵动岛歌词”的专辑封面取色逻辑，大幅提升\n" +
                        "- 优化xposed相关功能的稳定性和兼容性\n" +
                        "- 优化xposed相关功能的日志输出\n" +
                        "- 优化多个页面性能"
            ),
            ChangelogItem(
                version = "5.7-1928",
                title = "本次更新日志如下",
                summary = "- 新增音乐信息“居中显示”功能\n" +
                        "- 新增“更新日志”页面\n" +
                        "- 新增“歌曲信息”滚动\n" +
                        "- 新增超级岛“边缘光效封面色”\n" +
                        "- 主页“特殊功能”新增模块激活状态检测\n" +
                        "- 歌曲信息“滚动延迟”和“滚动循环间隔”最大值提升到10秒\n" +
                        "- 悬浮底栏新增高光样式\n" +
                        "- 合并“歌词提供服务”和“歌词白名单”页面，优化白名单逻辑，无需手动添加\n" +
                        "- 优化翻译和ai翻译功能\n" +
                        "- 优化主页底栏、权限弹窗、日志等级的样式\n" +
                        "- 优化日志扫描内容\n" +
                        "- 优化应用架构\n" +
                        "- 应用内全部toast替换成snackbar\n" +
                        "- 优化模糊效果\n" +
                        "- 优化组件间距\n" +
                        "- 优化性能"
            ),
            ChangelogItem(
                version = "",
                title = "",
                summary = "v5.7之前的更新内容请前往酷安或github查看"
            )
        )
    }
}
